albegam123/echo_byte/sdkconfig.defaults
# ESP32-S3-DevKitC-1-N32R16
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="32MB"
CONFIG_ESPTOOLPY_OCT_FLASH=y
CONFIG_ESPTOOLPY_FLASHMODE_OPI=y
CONFIG_ESPTOOLPY_FLASH_SAMPLE_MODE_DTR=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# 16 MB octal PSRAM. DMA-critical buffers stay in internal SRAM.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536

# Rust main task and deterministic 1 ms FreeRTOS tick.
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=32768
CONFIG_ESP_MAIN_TASK_AFFINITY_CPU1=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Wi-Fi + lightweight NimBLE only (no Bluedroid / Classic BT).
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=256
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=6144
CONFIG_BT_NIMBLE_NVS_PERSIST=n
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_CLASSIC_ENABLED=n

# Wi-Fi/BLE radio coexistence.
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=y

# Captive portal server limits.
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# Shared OTA layout. The ESP-SR build places its selected WakeNet data in the
# `model` partition; the open backend leaves that partition unused.
CONFIG_PARTITION_TABLE_CUSTOM=y
# esp-idf-sys builds its generated ESP-IDF project at
# target/<triple>/<profile>/build/<hash>/out, six levels below this file.
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="../../../../../../partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# ESP-SR 2.5.3 model selection. The model image is generated in both builds;
# only the audio-esp-sr Rust feature initializes and links the backend.
CONFIG_MODEL_IN_FLASH=y
CONFIG_SR_NSN_WEBRTC=y
CONFIG_SR_VADN_WEBRTC=y
CONFIG_SR_WN_WN10_NIHAOXIAOZHI=y
